.cf.xml/DataProcessors/обм_ИсходящиеСообщения_СозданиеАдресацияОтправка_ПереопределяемыйИнтерфейс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>обм_ИсходящиеСообщения_СозданиеАдресацияОтправка_ПереопределяемыйИнтерфейс</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеализацияИнтерфейса</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

.cf.xml/Catalogs/обм_ИсходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>обм_ИсходящиеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагОшибкиПриСоздании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

.cf.xml/DataProcessors/обм_ИсходящиеСообщения_СозданиеАдресацияОтправка_ПереопределяемыйИнтерфейс/Ext/ObjectModule.bsl
#Область ПереопределяемыйОбработчикомИнтерфейс

Функция ВерсияИнтерфейса() Экспорт
	
	Возврат "250701";
	
КонецФункции

Функция РеализованИнтерфейс(пМетаданныеИнтерфейса) Экспорт
	
	Если пМетаданныеИнтерфейса = Метаданные.Обработки.обм_ИсходящиеСообщения_СозданиеАдресацияОтправка_ПереопределяемыйИнтерфейс Тогда
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ИсходящееСообщение_Отправить(пИсходящееСсылка, пУзел) Экспорт
	
	Если ПустаяСтрока(пУзел) Тогда
		ВызватьИсключение "Не заполнен узел-получатель";
		
	КонецЕсли;
	
	общ.Проверка_Тип(пИсходящееСсылка, Тип("СправочникСсылка.обм_ИсходящиеСообщения"));
	
	Если Не ЗначениеЗаполнено(пИсходящееСсылка) Тогда
		ВызватьИсключение "Нет исходящего сообщения";
		
	КонецЕсли;
	
	РеализацияИнтерфейса.ИсходящееСообщение_Отправить(пИсходящееСсылка, пУзел);
	
КонецФункции

Функция ИсходящееСообщение_Создать(пСсылкаИсточника) Экспорт
	
	ответПоУмолчанию = Неопределено;
	
	Если Не общ.ЭтоЗаполненнаяСсылка(пСсылкаИсточника) Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	Попытка
		результатСоздания = РеализацияИнтерфейса.ИсходящееСообщение_Создать(пСсылкаИсточника);
		
	Исключение
		результатСоздания = Справочники.обм_ИсходящиеСообщения.СоздатьЭлемент();
		результатСоздания.ФлагОшибкиПриСоздании = Истина;
		
	КонецПопытки;
	
	Если результатСоздания = Неопределено Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	общ.Проверка_Тип(результатСоздания, "СправочникОбъект.обм_ИсходящиеСообщения, Неопределено");
	
	исходящие = Новый Массив;
	Если ТипЗнч(результатСоздания) = Тип("Массив") Тогда
		исходящие = результатСоздания;
		
	ИначеЕсли ТипЗнч(результатСоздания) = Тип("СправочникОбъект.обм_ИсходящиеСообщения") Тогда
		исходящие.Добавить(результатСоздания);
		
	КонецЕсли;
	
	Если исходящие.Количество() = 0 Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	индекс = исходящие.Количество();
	Пока индекс > 0 Цикл
		индекс = индекс - 1;
		исходящееОбъект = исходящие[индекс];
		
		Если ТипЗнч(исходящееОбъект) <> Тип("СправочникОбъект.обм_ИсходящиеСообщения") Тогда
			исходящие.Удалить(индекс);
			Продолжить;
			
		КонецЕсли;
			
		исходящееОбъект.Источник = пСсылкаИсточника;
		
		// Если обработчик отправки не заполнен, назначить этот обработчик обработчиком отправки
		Если Не ЗначениеЗаполнено(исходящееОбъект.ОбработчикОтправки) Тогда
			исходящееОбъект.ОбработчикОтправки = Справочники.общ_Обработчики.НайтиСсылку(РеализацияИнтерфейса);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат исходящие;
	
КонецФункции

#КонецОбласти // ПереопределяемыйОбработчикомИнтерфейс

// Инициализация по умолчанию
РеализацияИнтерфейса = ЭтотОбъект;
